In [1]:
from bs4 import BeautifulSoup
import requests

In [4]:
url = "https://en.wikipedia.org/wiki/List_of_largest_companies_in_the_United_States_by_revenue"

page = requests.get(url)
soup = BeautifulSoup(page.text,"html")

In [11]:
table = soup.find_all("table")[1] #We get our table seperately using index. There are 4 tables in the page and ours is 2nd,so we
#use 1 as index. We can also use class instead of index to find our table

In [21]:
table_headers = table.find_all("th") #we are getting only the header part(th tag)

table_header_list=[header.text.strip() for header in table_headers]
print(table_header_list)

['Rank', 'Name', 'Industry', 'Revenue (USD millions)', 'Revenue growth', 'Employees', 'Headquarters']

In [22]:
import pandas as pd

In [30]:
df = pd.DataFrame(columns = table_header_list) #Storing the headers in pandas data frame
df

Empty DataFrame
Columns: [Rank, Name, Industry, Revenue (USD millions), Revenue growth, Employees, Headquarters]
Index: []

In [32]:
table_rows = table.find_all("tr")

In [41]:
for row in table_rows[1:]:
    row_data = row.find_all("td") #Getting the data part from our table
    company_data = [data.text.strip() for data in row_data]  
    
    lenght = len(df)
    df.loc[lenght] = company_data #Stoing the data in our pandas data frame

In [42]:
df

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,"611,289",6.7%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and Cloud Computing,"513,983",9.4%,"1,540,000","Seattle, Washington"
2,3,Exxon Mobil,Petroleum industry,"413,680",44.8%,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,"394,328",7.8%,"164,000","Cupertino, California"
4,5,UnitedHealth Group,Healthcare,"324,162",12.7%,"400,000","Minnetonka, Minnesota"
...,...,...,...,...,...,...,...
195,96,Best Buy,Retail,"46,298",10.6%,"71,100","Richfield, Minnesota"
196,97,Bristol-Myers Squibb,Pharmaceutical industry,"46,159",0.5%,"34,300","New York City, New York"
197,98,United Airlines,Airline,"44,955",82.5%,"92,795","Chicago, Illinois"
198,99,Thermo Fisher Scientific,Laboratory instruments,"44,915",14.5%,"130,000","Waltham, Massachusetts"
199,100,Qualcomm,Technology,"44,200",31.7%,"51,000","San Diego, California"

In [43]:
#Exporting the data from dataframe to csv file and asking the program to ignore index col

df.to_csv(r"D:\Data Analysis\Python Project files\WebScrapper CSV export file\WebScrapperExportFile.csv",index=False)